
    public class Solution {
            public static void main(String[] args) {
           /* 1.2 Переменные
            1 задание
               У вас есть две переменных, в которых хранятся два целочисленных числа. Напишите программу,
               которая выводит в консоль результат деления первого числа на второе с остатком.
               В качестве исходных данных используйте значения для первого числа *– 47, для второго – 13):*
               В результате деления 47 / 13
               Выходит 3 и 8 в остатке
             */
             int integer1 = 47;
             int integer2 = 13;
             int remainder = integer1 % integer2;
             float fraction = ( 47 / 13f);
             int result = integer1 / integer2;

             System.out.println("В результате деления двух переменных , integer1 на integer2, выходит "+ result+ " и "+ remainder+ " в остатке . Или "+fraction );


                }
            }










